/**
    Create player init diary records.
    SUBJECT - diary subject. "Diary" = Briefing. Can be custom 
    player createDiaryRecord [SUBJECT, [TITLE, DESCRIPTION, ICON]]
 */
player createDiaryRecord ["Diary", [
    "Выполнение",
    "Бронетехники на ходу нет. Придется использовать преимущества пехоты, держать хорошее укрытие и отвоевывать Черноруссию шаг за шагом.
    \nСилы противника также потерпели огромный урон. Сильное сопротевление не ожидается, однако необходимо быть начеку при любом раскладе."
    ]
];
player createDiaryRecord ["Diary", [
    "Миссия", 
    "Контратакуйте противника. Займите плацдарм и не отдавайте ни метра территории."
    ]
];
player createDiaryRecord ["Diary", [
    "Ситуация", 
    "Российские войска ведут затяжные бои с силами США.
    Последняя атака американцей нанесла серьезные потери личному составу и забрала с собой все единицы боеспособной техники.
    \nСвевременная успешная контратака позволит оттеснить силы США назад до прибытия подкрепления.
    \nВместе с оставшимися силами пехоты начните наступление на позиции врага, займите подходящую линию обороны и ожидайте дальнейших приказов."
    ]
];
